Autodesk.Revit.DB.Units.GetModifiableUnitTypes
Gets all unit types for which the default FormatOptions can be modified.
Remarks:
The Units class stores a FormatOptions object for every valid unit
type, but not all of them can be directly modified.  Some, like
UT_Number and UT_SiteAngle, have fixed definitions.  Others have
definitions which are automatically derived from other unit types.
For example, UT_SheetLength is derived from UT_Length and
UT_ForceScale is derived from UT_Force.
Returns:
The unit types for which the FormatOptions can be modified.
Since:
2014

Autodesk.Revit.DB.Units.IsModifiableUnitType(Autodesk.Revit.DB.UnitType)
Checks whether the default FormatOptions can be modified for a given unit type.
Remarks:
The Units class stores a FormatOptions object for every valid unit
type, but not all of them can be directly modified.  Some, like
UT_Number and UT_SiteAngle, have fixed definitions.  Others have
definitions which are automatically derived from other unit types.
For example, UT_SheetLength is derived from UT_Length and
UT_ForceScale is derived from UT_Force.
unitType:
The unit type to check.
Returns:
True if the FormatOptions can be modified, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2014

Autodesk.Revit.DB.Units.SetFormatOptions(Autodesk.Revit.DB.UnitType,Autodesk.Revit.DB.FormatOptions)
Sets the default FormatOptions for a unit type.
Remarks:
Some unit types have definitions which are automatically derived
from other unit types.  For example, UT_SheetLength is derived from
UT_Length and UT_ForceScale is derived from UT_Force.  In such
cases, calling SetFormatOptions() for one unit type may have the
side effect of changing the FormatOptions for other unit types that
depend on it.
unitType:
The unit type.
options:
The ForrmatOptions.
Throws Autodesk.Revit.Exceptions.ArgumentException:
unitType is an invalid unit type.  See UnitUtils.IsValidUnitType() and UnitUtils.GetValidUnitTypes().
-or-
FormatOptions cannot be modified for unitType.  See Units.IsModifiableUnitType() and Units.GetModifiableUnitTypes().
-or-
UseDefault is true in options.
-or-
The display unit in options is not a valid display unit for unitType.  See UnitUtils.IsValidDisplayUnit(UnitType, DisplayUnitType) and UnitUtils.GetValidDisplayUnits(UnitType).
-or-
The rounding method in options is not set to Nearest.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2014

Autodesk.Revit.DB.Units.GetFormatOptions(Autodesk.Revit.DB.UnitType)
Gets the default FormatOptions for a unit type.
unitType:
The unit type.
Returns:
A copy of the FormatOptions.
Throws Autodesk.Revit.Exceptions.ArgumentException:
unitType is an invalid unit type.  See UnitUtils.IsValidUnitType() and UnitUtils.GetValidUnitTypes().
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2014

Autodesk.Revit.DB.Units.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Units.DigitGroupingAmount
The number of digits in each group when numbers are formatted with digit grouping.
Remarks:
This setting only has an effect when the UseDigitGrouping property
is set to true in the FormatOptions object for the unit type being
formatted.
The number of digits in each group.  The default is Three.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2014

Autodesk.Revit.DB.Units.DigitGroupingSymbol
The symbol used to separate groups of digits when numbers are formatted with digit grouping.
Remarks:
This setting only has an effect when the UseDigitGrouping property
is set to true in the FormatOptions object for the unit type being
formatted.
The digit grouping symbol.  The default is Comma.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2014

Autodesk.Revit.DB.Units.DecimalSymbol
The symbol used to separate the integer and fractional parts of a number.
The decimal symbol.  The default is Dot.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2014

Autodesk.Revit.DB.Units.#ctor(Autodesk.Revit.DB.UnitSystem)
Creates a new Units object with default settings for Metric or Imperial units.
unitSystem:
Indicates whether the Units object should be initialized with default settings for Metric or Imperial units.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2014

Autodesk.Revit.DB.Units
A document's default settings for formatting numbers with units.
Remarks:
The Units class represents a document's default settings for
formatting numbers with units as strings.  It contains a
FormatOptions object for each unit
type as well as settings related to decimal symbol and digit
grouping.
The Units class stores a FormatOptions object for every valid
unit type, but not all of them can be directly modified.  Some, like
UT_Number and UT_SiteAngle, have fixed definitions.  Others have
definitions which are automatically derived from other unit types.
For example, UT_SheetLength is derived from UT_Length and
UT_ForceScale is derived from UT_Force.  See
IsModifiableUnitType() and
GetModifiableUnitTypes().
Since:
2014